note/note-emacs.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>emacs note</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">emacs note</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga5b6c93">1. note-emacs</a>
<ul>
<li><a href="#org7b244fd">1.1. emacs tutorial</a></li>
<li><a href="#org5fc1b01">1.2. emacs lisp</a>
<ul>
<li><a href="#orgf9769d3">1.2.1. blog</a></li>
<li><a href="#org1ae073a">1.2.2. casting spels emacs</a>
<ul>
<li><a href="#org1cf9b5e">1.2.2.1. Syntax and Semantic</a></li>
<li><a href="#org803cc70">1.2.2.2. Defining the data for our Game World</a></li>
<li><a href="#org31fbfdf">1.2.2.3. Looking around in our game world</a></li>
</ul>
</li>
<li><a href="#org89b8c3b">1.2.3. code</a></li>
</ul>
</li>
<li><a href="#org9f01fd7">1.3. use emacs</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga5b6c93" class="outline-2">
<h2 id="orga5b6c93"><span class="section-number-2">1</span> note-emacs</h2>
<div class="outline-text-2" id="text-1">
<p>
the learning environment is mac<br>
</p>
</div>
<div id="outline-container-org7b244fd" class="outline-3">
<h3 id="org7b244fd"><span class="section-number-3">1.1</span> emacs tutorial</h3>
<div class="outline-text-3" id="text-1-1">
<p>
use c-h t open tutorial<br>
</p>

<p>
c - control  M - option<br>
</p>

<p>
c-x c-c  quit emacs<br>
</p>

<p>
c-g      quit current command<br>
</p>

<pre class="example">


                                上一行 C-p
                                     :
                                     :
               向左移 C-b .... 目前光标位置 .... 向右移 C-f
                                     :
                                     :
                                下一行 C-n

</pre>



<p>
c-/ | c-x u     undo<br>
</p>

<p>
c-_      undo step by step<br>
</p>

<p>
c-k      delete<br>
</p>

<p>
c-x c-f  search file<br>
</p>

<p>
c-x c-s  save file<br>
</p>

<p>
c-x s    save more buffer<br>
</p>

<p>
c-x c-b | c-x b  search buffer<br>
</p>

<p>
c-s     search forwards<br>
</p>

<p>
c-r     search backwards<br>
</p>

<p>
c-h k ()  query shortcut description<br>
</p>

<p>
c-h f ()  describe function<br>
</p>

<p>
c-h a     search for command g<br>
</p>

<p>
M-x linum-mode   show line number<br>
</p>
</div>
</div>
<div id="outline-container-org5fc1b01" class="outline-3">
<h3 id="org5fc1b01"><span class="section-number-3">1.2</span> emacs lisp</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgf9769d3" class="outline-4">
<h4 id="orgf9769d3"><span class="section-number-4">1.2.1</span> blog</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
<a href="http://www.woola.net/detail/2016-08-18-elisp.html">http://www.woola.net/detail/2016-08-18-elisp.html</a><br>
</p>
</div>
</div>
<div id="outline-container-org1ae073a" class="outline-4">
<h4 id="org1ae073a"><span class="section-number-4">1.2.2</span> casting spels emacs</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
a comic book : Emacs Lisp version<br>
<a href="http://www.lisperati.com/casting-spels-emacs/html/casting-spels-emacs-1.html">http://www.lisperati.com/casting-spels-emacs/html/casting-spels-emacs-1.html</a><br>
</p>

<p>
Emacs <b>scratch</b> buffer is Lisp interacion : c-x b <b>scratch</b><br>
</p>


<p>
Emacs tutorial <a href="https://www.gnu.org/software/emacs/tour/">https://www.gnu.org/software/emacs/tour/</a><br>
</p>


<p>
Emacs manual : <a href="https://www.gnu.org/software/emacs/manual/index.html">https://www.gnu.org/software/emacs/manual/index.html</a><br>
</p>

<p>
c-x c-e  : evaluable each expression (move the cursor to the end of each expression )<br>
</p>

<p>
M-x top-level : clears out errors<br>
</p>

<p>
M-x ielm  : ELISP&gt;<br>
</p>

<p>
(setq eval-expression-print-length nil) : prevent emacs truncate messages<br>
</p>

<p>
(require 'cl) : the library to make elisp run Common lisp command<br>
</p>
</div>


<div id="outline-container-org1cf9b5e" class="outline-5">
<h5 id="org1cf9b5e"><span class="section-number-5">1.2.2.1</span> Syntax and Semantic</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<p>
any text you give elisp interprater has to be arranged into list ,can be nested into lists of<br>
lists,a list in elisp (bla bla bla (abc abc))<br>
</p>

<p>
elis: interprater uses two modes to read code:  Code mode / Data mode.<br>
in data mode,you can put anything into your list ;<br>
in Code mode, your list need to be special type of list called a form :<br>
</p>

<pre class="example">

(foo bla bla bla)
  ^          ^
  |          |
command     a form
</pre>
</div>
</div>

<div id="outline-container-org803cc70" class="outline-5">
<h5 id="org803cc70"><span class="section-number-5">1.2.2.2</span> Defining the data for our Game World</h5>
<div class="outline-text-5" id="text-1-2-2-2">
<p>
in order to learn some more about forms,examples:<br>
</p>
<pre class="example">
(setq objects '(whiskey-bottle bucket frog chain))

| code mode    | The single quote to 'flip' the compiler into Date mode |                                     |   |   |
|--------------+--------------------------------------------------------+-------------------------------------+---+---|
| setq objects | '                                                      | (whiskey-bottle bucket frog chain)) |   |   |
|--------------+--------------------------------------------------------+-------------------------------------+---+---|

</pre>
<p>
the command sets a variable to a value : the variable is objects and the value is a list<br>
</p>
</div>
</div>

<div id="outline-container-org31fbfdf" class="outline-5">
<h5 id="org31fbfdf"><span class="section-number-5">1.2.2.3</span> Looking around in our game world</h5>
<div class="outline-text-5" id="text-1-2-2-3">
<p>
The word defun means, as you might expect, that we're defining a function<br>
</p>
<pre class="example">
(defun describe-location (location map)
    (second (assoc location map)))
</pre>
<p>
The assoc command does this and then returns the data describing the living-room<br>
</p>

<p>
Then the command second trims out the second item in that list, which is the description of the living-room<br>
</p>
</div>
</div>
</div>

<div id="outline-container-org89b8c3b" class="outline-4">
<h4 id="org89b8c3b"><span class="section-number-4">1.2.3</span> code</h4>
<div class="outline-text-4" id="text-1-2-3">
<div class="org-src-container">
<pre class="src src-elisp">
(<span style="color: #9d0006;">setq</span> objects '(whiskey-bottle bucket frog chain))

(<span style="color: #9d0006;">setq</span> object-locations '((whiskey-bottle living-room)
                           (bucket living-room)
                           (chain garden)
                           (frog garden)))

(<span style="color: #9d0006;">setq</span> location 'living-room)

(<span style="color: #9d0006;">setq</span> map '((living-room (you are in the living room
                of a wizards house - there is a wizard
                snoring loudly on the couch -)
                (west door garden)
                (upstairs stairway attic))
              (garden (you are in a beautiful garden -
                there is a well in front of you -)
                (east door living-room))
              (attic (you are in the attic of the
                wizards house - there is a giant
                welding torch in the corner -)
                (downstairs stairway living-room))))

(<span style="color: #9d0006;">defun</span> <span style="color: #b57614;">describe-location</span> (location map)
    (second (assoc location map)))


(describe-location 'living-room map)

(message <span style="color: #79740e;">"hello world"</span>)

(<span style="color: #9d0006;">defun</span> <span style="color: #b57614;">hello-world</span> (name)
 <span style="color: #79740e;">"say hello to user whose name is XX"</span>
   (message <span style="color: #79740e;">"hello , %s"</span> name))

(hello-world <span style="color: #79740e;">"manue1"</span>)

(<span style="color: #9d0006;">setq</span> foo <span style="color: #79740e;">"i'm manue1"</span>)
(message foo)

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9f01fd7" class="outline-3">
<h3 id="org9f01fd7"><span class="section-number-3">1.3</span> use emacs</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><p>
<code>counsel-git</code>  <br>
</p>

<p>
查找当前文件所在的版本控制系统内的其他文件 <code>, g f</code><br>
</p></li>
<li><p>
init-evil.el<br>
</p>

<p>
定义一些快捷键<br>
</p></li>
<li><p>
major mode / minor mode<br>
</p>

<p>
major mode : 语法高亮 主要基本功能a<br>
</p>

<p>
text-mode special-mode prog-mode(js2-mode所有编程语言继承这种mode)<br>
</p>

<p>
命名: xxx-mode-key-map , xxx-mode-hook<br>
</p>

<p>
minor mode : 增强性功能<br>
</p></li>
<li><p>
load-file / load / require /provide /autoload<br>
</p>

<p>
require : If feature FEATURE is not loaded, load it from FILENAME. (c-h f)<br>
内部调用load<br>
</p>

<p>
load : load elc file(byte-compile-file) 修改el配置 load再次加载是没有没更新<br>
依赖load-file<br>
</p>

<p>
load-file 明确加载el/elc文件<br>
</p>

<p>
provide -&gt; 执行一次load-file后,更新feature<br>
</p>

<p>
autoload : (autoload 'test "init-test") 当调用test函数时候，才会执行加载init-test文件<br>
<code>;;;####autoload</code><br>
</p></li>
<li><p>
dird mode (c-x d)<br>
</p>

<p class="verse">
<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;+ : create a directory<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;c-x c-f : new file<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;g: to reflush buffer<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;C: copy file<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;D: delete file<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;R: rename file<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;Shift + 6 : 切换上级目录<br>
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;c-x c-j: 快速打开当前文件目录<br>
</p></li>
<li><p>
org-mode auto create emacs conf<br>
</p>

<ul class="org-ul">
<li>init.el<br></li>
</ul>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #458588;">(</span>package-initialize<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span><span style="color: #9d0006;">require</span> '<span style="color: #8f3f71;">org-install</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span><span style="color: #9d0006;">require</span> '<span style="color: #8f3f71;">ob-tangle</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>org-bable-load-file <span style="color: #b16286;">(</span>expand-file-name <span style="color: #79740e;">"manue1.org"</span> user-emacs-dictionary<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>

<p>
auto create manue1.el config<br>
</p></li>
<li><p>
counsel-git-grep<br>
</p>

<p>
<code>,gg</code>  通过关键字搜索版本内代码<br>
</p></li>
<li><p>
web mode<br>
</p>

<p>
<code>M-;</code> 注释<br>
</p>

<p>
支持js css html 语法高亮补全<br>
</p></li>
<li><p>
js2-refactor<br>
</p>

<p>
c-c c-m<br>
</p></li>
<li><p>
occur<br>
</p>

<p>
<code>M-s o</code> 快速跳转到当前页面定义的字符串<br>
</p>

<p>
M-x customize-group popwin<br>
</p>

<p>
右边显示<br>
</p>

<p>
occur-edit  可以直接修改<br>
</p></li>
<li><p>
ag<br>
</p>

<p>
brew install the_silver_search<br>
</p>

<p>
helm-ag<br>
</p>

<p>
<code>c-c s</code><br>
</p></li>
<li><p>
flycheck<br>
</p>

<p>
show  js error with<br>
</p></li>
<li><p>
yasnippet<br>
</p>

<p>
自动生成代码 补全代码<br>
</p>

<p>
auto-yasnippet<br>
</p>

<p>
自定义生成的常用代码<br>
</p>

<p>
,ac (aya-create)<br>
</p></li>
<li><p>
which key<br>
</p>

<p>
, 列出所有按键<br>
</p></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>